Courses/7140/Lectures/Specs/spec-examples-small.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Specifications of Tiny Example Programs</title>
<!-- 2018-09-19 Wed 08:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Specifications of Tiny Example Programs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Exercises on Tiny Examples</a></li>
<li><a href="#sec-2">2. Mark Errors</a></li>
<li><a href="#sec-3">3. Condense the List of Numbers</a></li>
<li><a href="#sec-4">4. Simple Simultaneous Substitutions</a></li>
<li><a href="#sec-5">5. Game of Tic-Tac-Toe</a></li>
<li><a href="#sec-6">6. Game of Freecell Solitaire</a></li>
<li><a href="#sec-7">7. Specifications of /bin/ls</a></li>
<li><a href="#sec-8">8. The Telegram Problem of Peter Naur</a></li>
<li><a href="#sec-9">9. The Problem of "Tabulate the Equations"</a></li>
<li><a href="#sec-10">10. Pretty Print Java Source Code</a></li>
<li><a href="#sec-11">11. Convert C++ to Java</a></li>
<li><a href="#sec-12">12. The Common Words Problem solved by Knuth</a></li>
<li><a href="#sec-13">13. References</a></li>
</ul>
</div>
</div>
<p>
Abstract: We describe how several small example programs can be
specified rigorously and unambiguously.  [Not all answers are linked
here.  If you want them, write to me.]
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Exercises on Tiny Examples</h2>
<div class="outline-text-2" id="text-1">
<p>
For each of the following informally expressed functions, do two
things. (a) Discuss the amibguities, if any, present in the English
prose descriptions.  (b) Write rigorous and unambiguous {\sl
functional specifications}.  Remember that the weaker the
preconditions, the better the spec is.  You can use any of the
"well-known" functions.  To keep this handout compact, I have dropped
the phrase "A function that yields the &#x2026;"  from the beginning of
each problem statement.
</p>

<ol class="org-ol">
<li>second smallest number from the given set of integers.
</li>

<li>sum of two (a) matrices, (b) sets, (c) bags, (d) sequences.
</li>

<li>number of 1's in the binary representation of the given natural number.
</li>

<li>set of all prime factors of a given natural number.  Examples: 12
mapsto {2, 3}; 256 mapsto {2}.
</li>

<li>sorted sequence from a given pair of sequences of integers that may
or may not be sorted.
</li>

<li>reverse of the given sequence of characters.  For example, given
"abdbc" return "cbdba".
</li>

<li>value true iff the two sequences of characters are a permutation of
each other.  Some characters may appear more than once.
</li>

<li>pruned sequence of words, each of which contains at least three
different vowels, from the given sequence of words.
</li>

<li>pruned sequence of words that have a prefix (i.e., initial
substring) matching the given word.  A dictionary of words is
global.
</li>

<li>tab-free sequence s of lines from a given sequence t of lines that
may contain tabs.  Both s and t "look the same when printed".
Assume that tab positions are set at every multiple of 8.
</li>

<li>number of white-space "rivers" in a given text file.  Assume that
the file does not contain tabs.  When a text file is printed,
rivers are seen as 2-dimensional connected chains of white spaces.
</li>

<li>magic squares of size n x n.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mark Errors</h2>
<div class="outline-text-2" id="text-2">
<p>
In processing an input line of text, a program we are working on
discovered errors.  Each error is recorded as a pair \((p, e)\) of
numbers.  We wish to point to the \(p\)-th character that caused the
error, and print the error number \(e\) next to it.  Some times a single
position in the input line triggers multiple errors.  You are given a
list of these pairs, and the input line.  We need a procedure that
prints this line, and the error numbers below it, properly located.
Use no more lines than necessary.  [An Exercise from Niklaus Wirth,
Systematic Programming book, 197x]
</p>

<p>
<b>Spec by Example 1</b>
</p>

<div class="org-src-container">

<pre class="src src-bash">error list      :(4,1), (7,2), (10, 2), (20, 2), (23, 2).
column numbers  :1234567890123456789012345
line of text    : Thos broplem is peenuds.
line of errors  :   ^1 ^2 ^2        ^2 ^2
</pre>
</div>

<p>
<b>Spec by Example 2</b>
</p>
<div class="org-src-container">

<pre class="src src-bash">error list      :(5, 9), (13, 9), (13, 787), (18,94), (18, 126), (25,73),
(continued)     :(30, 9), (30, 23), (30, 26), (39, 9), (40, 742).
column numbers  :12345678901234567890123456789012345678901234
line of text    : if x &gt; 0 anf y +) then 0 := x else f(x.y) ;
line of errors  :    ^9      ^9   ^94,126^73  ^9,23,26 ^9
line of errors  :            ^787                       ^742
</pre>
</div>

<p>
[We can never specify software using examples.  But, this is popular
because it quickly communicates essential features.  Where it
typically fails is in the "edge" cases.]
</p>

<p>
Further details at <a href="../Examples/Mark-Error-Pos">../Examples/Mark-Error-Pos</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Condense the List of Numbers</h2>
<div class="outline-text-2" id="text-3">
<p>
Consider the informal description, given in the next paragraph, of a
program. Give (a) requirements analysis, (b) precise specifications (using
logic/discrete mathematics, or in carefully worded English), (c) a design,
in pseudo-code.
</p>

<p>
{You are given a comma separated list of items in a text file. The
list is terminated with a period. Each item is either a number, or a hyphen
separated pair of numbers. Your program should condense this list as much
as possible, as can be seen from the following examples.}
</p>

<p>
<b>Acceptance Test Examples</b>
</p>

<p>
<code>1,3,4,2,6,5,8,5,7.</code> becomes <code>1-8.</code>
</p>

<p>
<code>9,100-4870,4993,4871-4875,5016,5118,7-250,5100-5123.</code> becomes
<code>7-4875,4993,5016,5100-5123.</code>
</p>

<p>
<code>1103,1023-1100,87654321,1050-1150,1110,1250-1344.</code> becomes
<code>1023-1150,1250-1344,87654321.</code>
</p>

<p>
[This is also specifying by examples.  This time we are pointing out
the use of such things in acceptance tests.]
</p>

<p>
<a href="../Examples/Condense-Num-Ranges">../Examples/Condense-Num-Ranges</a>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Simple Simultaneous Substitutions</h2>
<div class="outline-text-2" id="text-4">
<p>
This program should work like a Unix filter.  It should translate a
sequence of bytes input to it by replacing certain input bytes \(b_i\)
by a byte sequence \(s_i\).  The replacements required are given in a
binary file as a set of ordered pairs \((b_i, s_i)\); it is possible
that some \(s_j\) are empty sequences.  {\sl You design the detailed
format of this binary file.} 
</p>

<p>
<b>Non-Functional Specs:</b>
This program is intended to run on a
rather primitive machine with a severe shortage of memory.  The io
operations available are also primitive.  The open/close operations
are similar to those of Unix, but the read/write primitives can
read/write only sequences of bytes exactly 512-bytes long.
</p>

<p>
<code>int open(const char *filename, char readwritemode)</code>.  The mode char is
<code>r</code> for reading <code>w</code> for writing.  It returns a filehandle integer.
</p>

<p>
<code>int close(int filehandle)</code>.
</p>

<p>
<code>int readblock(int filehandle, char * buffer)</code> will read the next
512 bytes (if available) into <code>buffer[]</code>.  If fewer than 512 bytes
are available, the <code>readblock</code> will pad the buffer with ASCII
NUL characters.  It returns the actual number of bytes read.
</p>

<p>
<code>int writeblock(int filehandle, char * buffer)</code> will write {\sl the}
512-bytes given in <code>buffer[]</code>.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Game of Tic-Tac-Toe</h2>
<div class="outline-text-2" id="text-5">
<p>
Specify the game in such a "good" way that someone who has not even
heard of this game, but a capable programmer, can program it.
</p>

<p>
This is adding the complication of state-by-state change.
</p>

<p>
Read further at
<a href="../Examples/TicTacToe-JavaFX-UnRedo/">../Examples/TicTacToe-JavaFX-UnRedo/</a>
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Game of Freecell Solitaire</h2>
<div class="outline-text-2" id="text-6">
<p>
Specify the game in such a "good" way that someone who has not even
heard of this game, but a capable programmer, can program it.
</p>

<p>
This is adding the complication of state-by-state change.
</p>

<p>
Read further at
<a href="../Examples/Solitaire-FreeCell/">../Examples/Solitaire-FreeCell/</a>
</p>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Specifications of /bin/ls</h2>
<div class="outline-text-2" id="text-7">
<p>
This is scaling up one step the size of programs we considered so far.
Consider the Unix standard command <code>/bin/ls</code>, but invoked without any
arguments or options.
</p>

<ol class="org-ol">
<li>The notion of Current Working Directory, and its contents.
</li>
<li>Raw Listing of CWD contents.
</li>
<li>Should <code>/bin/ls</code> take on the responsibility of "correct" CWD listing?
</li>
<li>Columnizing the listing <a href="../Examples/Columnize-Words">../Examples/Columnize-Words</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> The Telegram Problem of Peter Naur</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>"Write a program that takes a number w, then accepts lines of text
and outputs lines of text, where the output lines have as many
words as possible but are never longer than w characters. Words may
not be split, but you may assume that no single word is too long
for a line."
</li>
<li><a href="../Examples/Telegram-Problem">../Examples/Telegram-Problem</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> The Problem of "Tabulate the Equations"</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>{Our mathematician friend wants a program that can "tabulate" a
sequence of symbolic equations found in typical linear algebra into
a matrix form.}
</li>
<li><a href="../Examples/Tabulate-Eqns">../Examples/Tabulate-Eqns</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Pretty Print Java Source Code</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>The design and construction of pretty printers is a solved problem
for decades.  
<ol class="org-ol">
<li>See Mateti ref below.
</li>
<li>indent for C, C++ <code>apt-get install indent</code>
</li>
<li>Builtin pretty printers in Eclipse, Intellij, et al.
</li>
</ol>
</li>

<li>Problem Statement: Take indent, or one of the builtins.  Specify.
</li>

<li>Read further at <a href="../Examples/Pretty-Printer">../Examples/Pretty-Printer</a>
</li>

<li>Mateti, Prabhaker. "A Specification Schema for Indenting Programs."
Software: Practice and Experience, vol 13, no. 2 (1983): 163-179.
<a href="http://onlinelibrary.wiley.com/doi/10.1002/spe.4380130206/abstract">http://onlinelibrary.wiley.com/doi/10.1002/spe.4380130206/abstract</a>
Required Reading.
</li>

<li>Mateti, Prabhaker, and Joxan Jaffar. "A Correctness Proof of an
Indenting Program." Software: Practice and Experience, vol 13,
no. 3 (1983): 199-226.
<a href="http://onlinelibrary.wiley.com/doi/10.1002/spe.4380130302/abstract">http://onlinelibrary.wiley.com/doi/10.1002/spe.4380130302/abstract</a>
Recommended Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Convert C++ to Java</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>Problem Statement: We have a program P written C++.  Compiles and
links without errors.  May be loaded with bugs.  Convert this to
Java.  Without human intervention.  Bug-for-bug equivalent?  Must
compile free of errors.  Use well known C++ and Java libs.
</li>
<li>"Impossible" if we take "all of C++".  But, almost all "useful"
programs use a rather small subset of C++.
</li>
<li>If the program P is in this subC++, can we translate it to Java?
<ol class="org-ol">
<li>Answer is a definite Yes.
</li>
<li>The new problem: Define subC++.
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Defining subC++</h3>
<div class="outline-text-3" id="text-11-1">
<ol class="org-ol">
<li>Too expensive in resources to
<ol class="org-ol">
<li>Define the subC++ language (grammar, &#x2026;)
</li>
<li>Write yet another compiler, with good error reporting, for
subC++
</li>
</ol>
</li>

<li>Let GNU g++ do its thing
<ol class="org-ol">
<li>Parse its error messages to identify C++ usage outside of
subC++.
</li>
<li>Generate an Abstract Syntax Tree for P in subC++.
</li>
<li>Traverse this AST, while writing out Java.
</li>
</ol>
</li>

<li>This is just an outline.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> The Common Words Problem solved by Knuth</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>"Given a file of text, and a number k, print the k most common words."
</li>
<li>Used as an example of Literate Programming, the art of preparing
programs for human readers.  See <a href="../../Design/design-doc.html">../../Design/design-doc.html</a>.
</li>
<li>Our interest here:  How to describe its spec + design?
</li>
</ol>

<p>
Read further at <a href="../Examples/Knuth-CWP">../Examples/Knuth-CWP</a> 
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> References</h2>
<div class="outline-text-2" id="text-13">
<ol class="org-ol">
<li><a href="../Examples/">../Examples/</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-01-27
</div>
</body>
</html>
